<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"d03a6794c37961065286a0b07c0e82e542980e76830bbbc2c5db02a7b4fadbf2","plan_job_ref":"Job .github/workflows/_test-tf.yaml #219 at https://github.com/tx-pts-dai/github-workflows/actions/runs/11485539367","plan_out_hash":"faed3a5004258abfb4200f062c5881d2e58ffa23fff3d1096468d52d6ff16680","plan_hash":"ec29e306669efc9d2e38c5248505deb10ffebdea005b6ddf4f025b166e84d633","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #219](https://github.com/tx-pts-dai/github-workflows/actions/runs/11485539367)